---
kind: enumMember
id: F:Autodesk.Revit.DB.SunStudyTimeInterval.Minutes45
enum: Autodesk.Revit.DB.SunStudyTimeInterval
source: html/d09c8655-cbfa-6727-ca0c-9d1b4f12a767.htm
---
# Autodesk.Revit.DB.SunStudyTimeInterval.Minutes45

Interval occurs every 45 minutes.